In [1]:
import pandas as pd

### ì¹´í…Œê³ ë¦¬ íŒŒì¼ ì½ê¸°

In [3]:
# ì¹´í…Œê³ ë¦¬

path = '../csv/categories.csv'

df_category = pd.read_csv(path)

df_category['category'] = df_category['category'].astype(str)

df_category = df_category[['category', 'name']]

df_category.tail()

       category     name
1219  240100030  ì„œë¹„ìŠ¤/ë¯¸ë””ì–´
1220  240100050   ìƒì‚°/ê¸°ëŠ¥ì§
1221  240100070     ìƒë‹´ì˜ì—…
1222  240100090    ê¸°íƒ€ ì—…ì¢…
1223  240100110     ë‹¨ê¸°ì•Œë°”

### í´ë¦­ íŒŒì¼ ì½ê¸°

In [3]:
# ì„±, ì—°ë ¹, ì¹´í…Œê³ ë¦¬ì— ë”°ë¥¸ ì›”ë³„ í´ë¦­ ìˆ˜
read_path = '../csv/clicked_cohort.csv'
df_click = pd.read_csv(read_path)

df_click.tail()

          month_at  category_id         name   age  gender  clicked
550886  2019-04-01  500111005.0       ë‹ˆíŠ¸/ìŠ¤ì›¨í„°  78.0     0.0        1
550887  2019-04-01     600700.0          ëª¨ë°”ì¼  65.0     0.0        1
550888  2019-04-01  310220010.0      ìš°ë¹„/ë ˆì¸ì½”íŠ¸  53.0     1.0        1
550889  2019-04-01  700100350.0     ë†êµ¬ ì˜ë¥˜/ì¡í™”  91.0     1.0        1
550890  2019-04-01  310160999.0  ê¸°íƒ€(ë°˜ë°”ì§€/í•«íŒ¬ì¸ )  91.0     1.0        1

In [9]:
df_click['category_6'] = df_click['category_id'].astype(str).str[:6] # 2 depth category

df_click_6 = df_click.groupby(['month_at', 'category_6', 'age', 'gender'], as_index=False).agg({'clicked': 'sum'})

df_click_6.tail()

          month_at category_6   age  gender  clicked
110666  2019-04-01        nan  86.0     0.0       32
110667  2019-04-01        nan  87.0     0.0        6
110668  2019-04-01        nan  89.0     0.0        4
110669  2019-04-01        nan  89.0     1.0        6
110670  2019-04-01        nan  95.0     0.0        6

In [17]:
# ì¹´í…Œê³ ë¦¬ ë¶™ì´ê¸°
df_click_cate_6 = pd.merge(df_click_6, df_category[['category', 'name']], 
                           how='inner', left_on=['category_6'], right_on=['category'])

df_click_cate_6 = df_click_cate_6.drop(['category_6'], axis=1).rename(columns={'name': 'category_name'})

df_click_cate_6.tail()

          month_at    age  gender  clicked category category_name
102921  2019-04-01   98.0     0.0        2   910800       ê¸°íƒ€(ë°©ì†¡ì¸)
102922  2019-04-01  115.0     0.0       12   910800       ê¸°íƒ€(ë°©ì†¡ì¸)
102923  2019-02-01   22.0     0.0        1   500200     ì•„ë™(6ì„¸ ì´ìƒ)
102924  2019-03-01   39.0     0.0        1   500300            ì‹í’ˆ
102925  2019-04-01    0.0    -1.0        1   500300            ì‹í’ˆ

In [19]:
# save
save_path = '../csv/tmp/df_click_cate_6.csv'
df_click_cate_6.to_csv(save_path, index=False, mode='w', header=True)

### ê²€ìƒ‰ íŒŒì¼ ì½ê¸°

In [7]:
# ì„±, ì—°ë ¹, ì¹´í…Œê³ ë¦¬ì— ë”°ë¥¸ ì›”ë³„ ê²€ìƒ‰ ìˆ˜
read_path = '../csv/keywords_cohort.csv'
df_keyword = pd.read_csv(read_path)

df_keyword.tail()

            month_at      keyword   age  gender  search_num
43616018  2019-04-01  ê¼¼ë° ê°€ë””ê±´ 17fe   NaN     NaN           1
43616019  2019-04-01      ì‚¬ì¼ëŸ°íŠ¸ ê¸°íƒ€  44.0     1.0           2
43616020  2019-04-01           ì´ˆë¥´  19.0     0.0           2
43616021  2019-04-01         í˜€ë‰´í˜€ëˆ„  24.0     1.0           1
43616022  2019-04-01     ì»¨ë²„ìŠ¤ ì–‘ë§ìŠˆì¦ˆ  27.0     1.0           2

In [22]:
# í´ë¦­ëœ ìƒí’ˆì˜ ê²€ìƒ‰ í‚¤ì›Œë“œ ì¤‘ ê°€ì¥ ë§ì´ í´ë¦­ëœ ìƒí’ˆì˜ ì¹´í…Œê³ ë¦¬
read_path = '../csv/keyword_category_1901_1904.csv'
df_keyword_cate = pd.read_csv(read_path)

df_keyword_cate = df_keyword_cate.drop(['_count', '_num'], axis=1)

df_keyword_cate.tail()

            keyword     category      name
8596623        ğŸ’–ì‹ ìƒğŸŒ¸  320030100.0   ë§¨íˆ¬ë§¨ í‹°ì…”ì¸
8596624         ğŸ’¬ì°¢ì²­  320130200.0  ì²­/ë°ë‹˜ ë°˜ë°”ì§€
8596625  ğŸ’¯ë°œë Œì‹œì•„ê°€ ë¹Œ íƒ‘  400010100.0       ìˆ„ë”ë°±
8596626     ğŸš›ì •í’ˆ MCM  400083200.0     ë‚¨ì„± ë²¨íŠ¸
8596627      ğŸ¤˜êµ¬ì°Œ ì§€ê°‘  400060400.0  ë‚¨ì ì¤‘/ë°˜ì§€ê°‘

### ë²ˆí”„ íŒŒì¼ ì½ê¸°

In [36]:
# 1901 ~ 1904 ë²ˆí”„ êµ¬ë§¤ì™„ë£Œ ë°ì´í„°

read_path = '../csv/bunp_cohort.csv'
df_bunp = pd.read_csv(read_path)

df_bunp.tail()

,category_id,name,month_at,seller_age,seller_gender,buyer_age,buyer_gender,selled_count,bunp_amount
615529,400080.0,ì•ˆê²½/ì„ ê¸€ë¼ìŠ¤,2019-04-01,25,1,36,0,1,28000
615530,400040.0,ìš´ë™í™”/ìºì£¼ì–¼í™”,2019-04-01,39,1,63,1,1,310000
615531,310090.0,ì•¼ìƒ/ì í¼/íŒ¨ë”©,2019-04-01,57,1,0,-1,1,55000
615532,400010.0,ì—¬ì„±ê°€ë°©,2019-04-01,37,0,65,0,1,98000
615533,700350.0,ìì „ê±°/MTB,2019-04-01,14,1,43,0,1,15000

In [14]:
# 19ë…„ 1ì›” ì´í›„ ë“±ë¡ëœ ìƒí’ˆë§Œ

read_path = '../csv/bunp_cohort_since_1901.csv'
df_bunp_since_1901 = pd.read_csv(read_path)

df_bunp_since_1901.tail()

,category_id,name,month_at,seller_age,seller_gender,buyer_age,buyer_gender,selled_count,bunp_amount
423707,240100.0,ì•Œë°”ì°¾ì•„ìš”,2019-03-01,17,0,15,0,1,1000
423708,240100.0,ì•Œë°”ì°¾ì•„ìš”,2019-03-01,17,1,17,0,1,2000
423709,240100.0,ì•Œë°”ì°¾ì•„ìš”,2019-02-01,18,0,51,1,1,9000
423710,240100.0,ì•Œë°”ì°¾ì•„ìš”,2019-03-01,17,1,18,0,2,4000
423711,NaN,NaN,2019-01-01,33,1,31,0,1,254400

### ë“±ë¡ ì œí’ˆ ì½ê¸°

In [17]:
read_path = '../csv/products_cohort.csv'
df_products = pd.read_csv(read_path)

df_products = df_products.drop(['status'], axis=1)

df_products.tail()

,enrolled_at,booked_at,deleted_at,sold_at,category_id,name,age,gender,products
307900,2019-01-01,NaN,NaN,NaN,240040.0,ì‚¬ë¬´/íšŒê³„,38.0,0.0,1
307901,2019-02-01,NaN,2019-02-01,NaN,240040.0,ì‚¬ë¬´/íšŒê³„,15.0,1.0,1
307902,2019-02-01,NaN,NaN,NaN,240040.0,ì‚¬ë¬´/íšŒê³„,30.0,0.0,1
307903,2019-04-01,NaN,NaN,NaN,240040.0,ì‚¬ë¬´/íšŒê³„,0.0,-1.0,1
307904,2019-01-01,NaN,2019-01-01,NaN,240040.0,ì‚¬ë¬´/íšŒê³„,29.0,0.0,1

In [57]:
df_products_enroll = df_products.groupby(['enrolled_at', 'category_id', 'name', 'age', 'gender'], as_index=False).agg({'products': 'sum'})
df_products_enroll.tail()

      enrolled_at  category_id     name   age  gender  products
63121  2019-05-01     910200.0      ê±¸ê·¸ë£¹  57.0     1.0         1
63122  2019-05-01     910400.0    ì†”ë¡œ(ì—¬)  15.0     0.0         1
63123  2019-05-01     910400.0    ì†”ë¡œ(ì—¬)  26.0     1.0         1
63124  2019-05-01     910800.0  ê¸°íƒ€(ë°©ì†¡ì¸)  15.0     0.0         1
63125  2019-05-01     910800.0  ê¸°íƒ€(ë°©ì†¡ì¸)  22.0     0.0         1

In [59]:
# save
save_path = '../csv/tmp/df_products_enroll.csv'
df_products_enroll.to_csv(save_path, index=False, mode='w', header=True)

### í´ë¦­ê³¼ ë²ˆí”„ íŒŒì¼ í•©ì¹˜ê¸°

In [40]:
# í´ë¦­ íŒŒì¼

read_path = '../csv/tmp/df_click_cate_6.csv'
df_click_cate_6 = pd.read_csv(read_path)

df_click_cate_6.tail()

          month_at    age  gender  clicked  category category_name
102921  2019-04-01   98.0     0.0        2    910800       ê¸°íƒ€(ë°©ì†¡ì¸)
102922  2019-04-01  115.0     0.0       12    910800       ê¸°íƒ€(ë°©ì†¡ì¸)
102923  2019-02-01   22.0     0.0        1    500200     ì•„ë™(6ì„¸ ì´ìƒ)
102924  2019-03-01   39.0     0.0        1    500300            ì‹í’ˆ
102925  2019-04-01    0.0    -1.0        1    500300            ì‹í’ˆ

In [43]:
# ë²ˆí”„ íŒŒì¼ ì¤‘ êµ¬ë§¤ì ë°ì´í„°

df_bunp_buyer = df_bunp.groupby(['category_id', 'month_at', 'buyer_age', 'buyer_gender'], as_index=False).agg({'selled_count': 'sum', 'bunp_amount': 'sum'})

df_bunp_buyer.tail()

,category_id,month_at,buyer_age,buyer_gender,selled_count,bunp_amount
49000,910800.0,2019-04-01,50,1,1,14000
49001,910800.0,2019-04-01,52,0,1,10000
49002,910800.0,2019-04-01,53,0,1,7000
49003,910800.0,2019-04-01,61,0,1,20000
49004,910800.0,2019-04-01,71,0,1,6800

In [48]:
df_click_bunp = pd.merge(df_click_cate_6, df_bunp_buyer, how='left', 
                        left_on=['month_at', 'age', 'gender', 'category'],
                        right_on=['month_at', 'buyer_age', 'buyer_gender', 'category_id'])

df_click_bunp = df_click_bunp.drop(['category_id', 'buyer_age', 'buyer_gender'], axis=1)

df_click_bunp.tail()

,month_at,age,gender,clicked,category,category_name,selled_count,bunp_amount
102921,2019-04-01,98.0,0.0,2,910800,ê¸°íƒ€(ë°©ì†¡ì¸),NaN,NaN
102922,2019-04-01,115.0,0.0,12,910800,ê¸°íƒ€(ë°©ì†¡ì¸),NaN,NaN
102923,2019-02-01,22.0,0.0,1,500200,ì•„ë™(6ì„¸ ì´ìƒ),NaN,NaN
102924,2019-03-01,39.0,0.0,1,500300,ì‹í’ˆ,NaN,NaN
102925,2019-04-01,0.0,-1.0,1,500300,ì‹í’ˆ,NaN,NaN

In [49]:
# save
save_path = '../csv/tmp/df_click_bunp.csv'
df_click_bunp.to_csv(save_path, index=False, mode='w', header=True)